vertical-pod-autoscaler/experiments/sn-pbr-throughput/17plus/compose.log
Running 15m test @ http://10.99.209.64:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 18.151ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 19.157ms, rate sampling interval: 43ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   592.86ms  526.72ms   2.42s    75.84%
    Req/Sec     4.92     10.69    47.00     80.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  448.26ms
 75.000%  843.26ms
 90.000%    1.31s 
 99.000%    2.42s 
 99.900%    3.31s 
 99.990%    4.00s 
 99.999%    4.00s 
100.000%    4.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.911     0.000000            1         1.00
      70.207     0.100000          884         1.11
     157.311     0.200000         1769         1.25
     244.479     0.300000         2651         1.43
     341.503     0.400000         3535         1.67
     448.255     0.500000         4419         2.00
     509.183     0.550000         4860         2.22
     575.487     0.600000         5305         2.50
     650.751     0.650000         5745         2.86
     743.423     0.700000         6186         3.33
     843.263     0.750000         6628         4.00
     897.535     0.775000         6848         4.44
     955.391     0.800000         7070         5.00
    1019.391     0.825000         7290         5.71
    1104.895     0.850000         7511         6.67
    1204.223     0.875000         7737         8.00
    1245.183     0.887500         7844         8.89
    1310.719     0.900000         7954        10.00
    1362.943     0.912500         8064        11.43
    1432.575     0.925000         8176        13.33
    1509.375     0.937500         8285        16.00
    1566.719     0.943750         8340        17.78
    1627.135     0.950000         8395        20.00
    1704.959     0.956250         8450        22.86
    1772.543     0.962500         8505        26.67
    1856.511     0.968750         8560        32.00
    1905.663     0.971875         8588        35.56
    1963.007     0.975000         8616        40.00
    2021.375     0.978125         8643        45.71
    2109.439     0.981250         8671        53.33
    2197.503     0.984375         8699        64.00
    2242.559     0.985938         8712        71.11
    2306.047     0.987500         8726        80.00
    2377.727     0.989062         8740        91.43
    2439.167     0.990625         8754       106.67
    2478.079     0.992188         8767       128.00
    2531.327     0.992969         8774       142.22
    2582.527     0.993750         8781       160.00
    2662.399     0.994531         8788       182.86
    2703.359     0.995313         8795       213.33
    2828.287     0.996094         8802       256.00
    2844.671     0.996484         8805       284.44
    2873.343     0.996875         8809       320.00
    2920.447     0.997266         8812       365.71
    2965.503     0.997656         8816       426.67
    3043.327     0.998047         8819       512.00
    3098.623     0.998242         8821       568.89
    3141.631     0.998437         8823       640.00
    3149.823     0.998633         8824       731.43
    3282.943     0.998828         8826       853.33
    3321.855     0.999023         8828      1024.00
    3354.623     0.999121         8829      1137.78
    3381.247     0.999219         8830      1280.00
    3381.247     0.999316         8830      1462.86
    3401.727     0.999414         8831      1706.67
    3430.399     0.999512         8832      2048.00
    3520.511     0.999561         8833      2275.56
    3520.511     0.999609         8833      2560.00
    3520.511     0.999658         8833      2925.71
    3948.543     0.999707         8834      3413.33
    3948.543     0.999756         8834      4096.00
    4001.791     0.999780         8836      4551.11
    4001.791     1.000000         8836          inf
#[Mean    =      592.863, StdDeviation   =      526.724]
#[Max     =     3999.744, Total count    =         8836]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8953 requests in 15.00m, 1.84MB read
  Socket errors: connect 0, read 0, write 6, timeout 17
Requests/sec:      9.95
Transfer/sec:      2.09KB